netgear/wndr3700v4/soaprequest_search.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <m:Search xmlns:m="urn:schemas-upnp-org:service:ContentDirectory:1">
            <ContainerID>1</ContainerID>
            <Filter>foo</Filter>
            <RequestedCount>100</RequestedCount>
            <StartingIndex>1</StartingIndex>
            <SearchCriteria>INJECTION</SearchCriteria>
            <SortCriteria/>
        </m:Search>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
